jnzim/stm32l476-baremetal-blinky/src/pwm.c
// pwm.c — TIM1 3-phase PWM for DRV8353RS-EVM gate driver, 3x PWM mode
// STM32F411/F446 bare metal
//
// Ownership:
//   This module owns:
//     - TIM1 PWM setup
//     - PA8 / PA9 / PA10 PWM pins
//     - phase voltage -> CCR conversion
//     - inverse Park / inverse Clarke voltage output
//
// DRV8353 3x PWM mode:
//   DRIVER_CONTROL = 0x0020
//
//   INHA / INHB / INHC receive PWM from TIM1 CH1/CH2/CH3.
//   INLA / INLB / INLC are per-phase enables and are tied high in hardware.
//   The DRV generates complementary low-side drive internally.
//
// Therefore:
//   - No TIM1 complementary outputs are used.
//   - No STM32 dead-time insertion is used.
//   - TIM1 only drives CH1 / CH2 / CH3.
//
// Pin map:
//   PA8  / TIM1_CH1 -> INHA
//   PA9  / TIM1_CH2 -> INHB
//   PA10 / TIM1_CH3 -> INHC
//
// Pins this module must not touch:
//   PA5 / PA6 / PA7 = DRV SPI1
//   PB0             = DRV ENABLE
//   PB1             = DRV nFAULT
//
// PWM timing:
//   Center-aligned PWM.
//   APB2 timer clock assumed 100 MHz.
//   ARR = 2499 gives:
//
//      f_pwm = 100 MHz / (2 * (2499 + 1)) = 20 kHz
//
// Note:
//   If APB2 timer clock is 84 MHz, use ARR = 2099 for 20 kHz.
//
// ADC trigger:
//   TIM1 CR2 MMS=111 routes OC4REF as TRGO.
//   ADC JEXTSEL=1 selects TIM1_TRGO as injected trigger.
//   CCR4 controls exactly when in the PWM cycle the ADC samples.
//
// Convention:
//   pwm_apply_dq(vd, vq, theta) — (vd, vq, theta) matches inverse Park directly.
//   Do not swap argument order. Do not change signs in the transform.

#include "pwm.h"
#include "board_f411.h"
#include "stm32f4xx.h"
#include "config.h"

#include <math.h>
#include <stdint.h>


// =============================================================================
// PWM geometry
// =============================================================================

#define PWM_ARR      2499u
#define PWM_CENTER   (PWM_ARR / 2u)


void pwm_init(void)
{
    // -------------------------------------------------------------------------
    // Enable peripheral clocks
    // -------------------------------------------------------------------------

    RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

    (void)RCC->APB2ENR;
    (void)RCC->AHB1ENR;


    // -------------------------------------------------------------------------
    // Configure PA8 / PA9 / PA10 as AF1 for TIM1_CH1/CH2/CH3
    // -------------------------------------------------------------------------

    GPIOA->MODER &= ~((3u << (PIN_PWM_A * 2u)) |
                      (3u << (PIN_PWM_B * 2u)) |
                      (3u << (PIN_PWM_C * 2u)));

    GPIOA->MODER |=  ((2u << (PIN_PWM_A * 2u)) |
                      (2u << (PIN_PWM_B * 2u)) |
                      (2u << (PIN_PWM_C * 2u)));

    GPIOA->OSPEEDR &= ~((3u << (PIN_PWM_A * 2u)) |
                        (3u << (PIN_PWM_B * 2u)) |
                        (3u << (PIN_PWM_C * 2u)));

    GPIOA->OSPEEDR |=  ((1u << (PIN_PWM_A * 2u)) |
                        (1u << (PIN_PWM_B * 2u)) |
                        (1u << (PIN_PWM_C * 2u)));

    GPIOA->AFR[1] &= ~((0xFu << ((PIN_PWM_A - 8u) * 4u)) |
                       (0xFu << ((PIN_PWM_B - 8u) * 4u)) |
                       (0xFu << ((PIN_PWM_C - 8u) * 4u)));

    GPIOA->AFR[1] |=  ((1u << ((PIN_PWM_A - 8u) * 4u)) |
                       (1u << ((PIN_PWM_B - 8u) * 4u)) |
                       (1u << ((PIN_PWM_C - 8u) * 4u)));


    // -------------------------------------------------------------------------
    // Clean TIM1 config
    // -------------------------------------------------------------------------

    TIM1->CR1  = 0u;
    TIM1->CR2  = 0u;
    TIM1->SMCR = 0u;
    TIM1->DIER = 0u;
    TIM1->CCER = 0u;
    TIM1->BDTR = 0u;


    // -------------------------------------------------------------------------
    // TIM1 base setup
    //
    // Center-aligned mode 1 (CMS=01).
    // RCR = 1 gives one update interrupt per full PWM period.
    //
    // CR2 MMS=111: routes OC4REF as TRGO.
    // ADC injected trigger (JEXTSEL=1 = TIM1_TRGO) fires when OC4REF rises.
    // CCR4 controls the sample point within the PWM cycle.
    // -------------------------------------------------------------------------

    TIM1->CR1 = TIM_CR1_CMS_0;
    TIM1->CR2 = (7u << TIM_CR2_MMS_Pos);   /* MMS=111: TRGO = OC4REF */
    TIM1->PSC = 0u;
    TIM1->ARR = PWM_ARR;
    TIM1->RCR = 1u;


    // -------------------------------------------------------------------------
    // TIM1 CH1/CH2/CH3 PWM outputs — PWM mode 1, preload enabled.
    //
    // TIM1 CH4 — PWM mode 1, no GPIO.
    //   OC4REF is HIGH when counter < CCR4.
    //   TRGO (MMS=111) fires on OC4REF rising edge.
    //   In center-aligned mode, OC4REF rises at CCR4 count on the way DOWN.
    // -------------------------------------------------------------------------

    TIM1->CCMR1 =
        TIM_CCMR1_OC1M_1 | TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1PE |
        TIM_CCMR1_OC2M_1 | TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2PE;

    TIM1->CCMR2 =
        TIM_CCMR2_OC3M_1 | TIM_CCMR2_OC3M_2 | TIM_CCMR2_OC3PE |
        TIM_CCMR2_OC4M_1 | TIM_CCMR2_OC4M_2;   /* OC4M=110 PWM mode 1 */


    // -------------------------------------------------------------------------
    // Initial phase duty: 50%
    // -------------------------------------------------------------------------

    TIM1->CCR1 = PWM_CENTER;
    TIM1->CCR2 = PWM_CENTER;
    TIM1->CCR3 = PWM_CENTER;


    // -------------------------------------------------------------------------
    // TIM1 CH4 ADC trigger
    //
    // CCR4 = PWM_ARR - PWM_SAMPLE_OFFSET: fires just after PWM peak on way down.
    // This places the sample in the low-side conduction window.
    // -------------------------------------------------------------------------

    //#define PWM_SAMPLE_OFFSET  250u
      #define PWM_SAMPLE_OFFSET  50u
    TIM1->CCR4 = PWM_ARR - PWM_SAMPLE_OFFSET;   // = 2449
    //TIM1->CCR4 = PWM_SAMPLE_OFFSET;   // trigger 2.5µs after valley, CSA settled


    // -------------------------------------------------------------------------
    // Enable CH1/CH2/CH3 outputs and CH4 compare event.
    // CC4E must be set even though CH4 drives no GPIO pin.
    // -------------------------------------------------------------------------

    TIM1->CCER = TIM_CCER_CC1E |
                 TIM_CCER_CC2E |
                 TIM_CCER_CC3E |
                 TIM_CCER_CC4E;


    // -------------------------------------------------------------------------
    // Keep bridge outputs disabled until pwm_enable().
    // -------------------------------------------------------------------------

    TIM1->BDTR = 0u;


    // -------------------------------------------------------------------------
    // Force preload transfer, clear flags, enable TIM1 update interrupt.
    // -------------------------------------------------------------------------

    TIM1->EGR = TIM_EGR_UG;
    TIM1->SR  = 0u;

    TIM1->DIER = TIM_DIER_UIE;

    NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 1);
    NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);


    // -------------------------------------------------------------------------
    // Start TIM1.
    // -------------------------------------------------------------------------

    TIM1->CR1 |= TIM_CR1_CEN;
}


// =============================================================================
// pwm_enable / pwm_disable
// =============================================================================

void pwm_enable(void)
{
    TIM1->BDTR |= TIM_BDTR_MOE;
}

void pwm_disable(void)
{
    TIM1->BDTR &= ~TIM_BDTR_MOE;
}


// =============================================================================
// pwm_set_duty — write one phase CCR
// =============================================================================

void pwm_set_duty(uint8_t phase, uint16_t duty)
{
    if (duty > PWM_ARR)
        duty = PWM_ARR;

    switch (phase)
    {
        case 0: TIM1->CCR3 = duty; break;
        case 1: TIM1->CCR2 = duty; break;
        case 2: TIM1->CCR1 = duty; break;
        default: break;
    }
}


// =============================================================================
// volts_to_duty — phase voltage command -> CCR count
// =============================================================================

uint16_t volts_to_duty(float v)
{
    float normalized = v / V_BUS;

    if (normalized >  1.0f) normalized =  1.0f;
    if (normalized < -1.0f) normalized = -1.0f;

    uint16_t ccr = (uint16_t)(normalized * (float)PWM_CENTER + (float)PWM_CENTER);

#define DUTY_MIN  100u
#define DUTY_MAX  2399u

    if (ccr < DUTY_MIN) ccr = DUTY_MIN;
    if (ccr > DUTY_MAX) ccr = DUTY_MAX;

    return ccr;
}


// =============================================================================
// pwm_apply_phase_volts
// =============================================================================

void pwm_apply_phase_volts(float va, float vb, float vc)
{
    pwm_set_duty(0, volts_to_duty(va));
    pwm_set_duty(1, volts_to_duty(vb));
    pwm_set_duty(2, volts_to_duty(vc));
}


// =============================================================================
// pwm_apply_dq — inverse Park + inverse Clarke voltage output
//
// Convention: pwm_apply_dq(vd, vq, theta)
//
// Inverse Park:
//   v_alpha = vd*cos(θ) - vq*sin(θ)
//   v_beta  = vd*sin(θ) + vq*cos(θ)
//
// Inverse Clarke (amplitude-invariant):
//   va =  v_alpha
//   vb = -0.5*v_alpha + (√3/2)*v_beta
//   vc = -0.5*v_alpha - (√3/2)*v_beta
//
// Do not swap vd/vq. Do not change signs.
// =============================================================================

void pwm_apply_dq(float v_d, float v_q, float theta)
{
    float cos_t = cosf(theta);
    float sin_t = sinf(theta);

    float v_alpha = (v_d * cos_t) - (v_q * sin_t);
    float v_beta  = (v_d * sin_t) + (v_q * cos_t);

    float va =  v_alpha;
    float vb = -0.5f * v_alpha + 0.86602540378f * v_beta;
    float vc = -0.5f * v_alpha - 0.86602540378f * v_beta;

    pwm_apply_phase_volts(va, vb, vc);
}